{
    "courseTitle": "Level 3 Certificate in Counselling Studies",
    "courseCode": "CPCAB CST-L3",
    "courseYear": "2024-2025",
    "sections": [
        {
            "id": 1,
            "learningOutcome": "Prepare to work within an ethical framework for counselling",
            "criteria": [
                {
                    "id": 1.1,
                    "title": "Apply understanding of an ethical framework to counselling practice sessions",
                    "guidance": [
                        "Consider and differentiate between what is required and what is recommended in a professional ethical framework – e.g. BACP.",
                        "Consider how an ethical framework informs professional counselling practice.",
                        "Demonstrate understanding of how ethical practice is evident in counselling practice sessions.",
                        "Explore ethical dilemmas by focused discussion of your own experience from working with case scenarios in counselling practice sessions."
                    ],
                    "claims": []
                },
                {
                    "id": 1.2,
                    "title": "Explain the importance of working within limits of proficiency",
                    "guidance": [
                        "Reflect on importance of ‘limits of proficiency’ in relation to ethical practice.",
                        "Discover the limits of your proficiency by focused discussion of your own experience of working with case scenarios in counselling practice sessions.",
                        "Show understanding by referring to new insights gained through discussion."
                    ],
                    "claims": []
                },
                {
                    "id": 1.3,
                    "title": "Describe the ethical, legal and procedural framework in which an agency operates",
                    "guidance": [
                        "Explore an agency’s ethical policy and procedure with reference to working ethically and safely.",
                        "Explore how legal processes might impact on an agency counselling service."
                    ],
                    "claims": []
                },
                {
                    "id": 1.4,
                    "title": "Demonstrate understanding of client assessment and referral in an agency setting",
                    "guidance": [
                        "Understand the role and purpose of client assessment and how it informs the counselling work itself.",
                        "Identify the nature and range of information necessary to begin to get a sense of the client’s perception of their problem and practice this process in counselling practice sessions.",
                        "Understand the importance of client assessment and explore referral issues.",
                        "Show skills in observed counselling practice sessions."
                    ],
                    "claims": []
                }
            ]
        },
        {
            "id": 2,
            "learningOutcome": "Understanding the counselling relationship",
            "criteria": [
                {
                    "id": 2.1,
                    "title": "Explain the nature and constraints of the counsellor role within different settings",
                    "guidance": [
                        "Clearly differentiate between the role of the counsellor in an agency as opposed to (for example) a helper or key worker for a client in the same organisation.",
                        "Explore the limitations of counselling, in relation to expectations of clients, in a range of different agency settings – e.g. rehabilitation centre, GP surgery, drop-in centre, young person’s advisory centre.",
                        "Practise explaining your role to clients in counselling practice sessions."
                    ],
                    "claims": []
                },
                {
                    "id": 2.2,
                    "title": "Establish and sustain the boundaries of the counsellor role in counselling practice sessions",
                    "guidance": [
                        "Explore boundary limits to the counselling relationship.",
                        "Identify situations and issues that challenge personal and professional boundaries and explore ways of managing these – e.g. “doorknob confessions”, attraction between counsellor and client, confidentiality issues etc.",
                        "Practise establishing and sustaining boundary limits to the counselling relationship.",
                        "Reflect on your ability to establish and sustain boundaries."
                    ],
                    "claims": []
                },
                {
                    "id": 2.3,
                    "title": "Explain how the counselling relationship contributes to the counselling work",
                    "guidance": [
                        "Clearly state what you feel and think is necessary to develop an effective (working) relationship with clients.",
                        "Define those characteristics of the counselling relationship that facilitate growth and change and identify attitudes which enable the counsellor to introduce those characteristics to the relationship.",
                        "Show skills in observed counselling practice sessions."
                    ],
                    "claims": []
                },
                {
                    "id": 2.4,
                    "title": "Manage the stages of the counselling relationship",
                    "guidance": [
                        "Identify three different stages in the counselling session and process.",
                        "Be clear about the reasons for attending to, and effectively using, the beginning, middle and end for the purpose of developing, maintaining and concluding the counselling process.",
                        "Show skills in observed counselling practice sessions."
                    ],
                    "claims": []
                }
            ]
        },
        {
            "id": 3,
            "learningOutcome": "Understand difference and diversity issues to develop empathic understanding",
            "criteria": [
                {
                    "id": 3.1,
                    "title": "Identify and reflect on diversity within personal relationships",
                    "guidance": [
                        "Learn about diversity through exploring the membership of the course group: the different beliefs and behaviour. Become aware of the demographics of your group – e.g. culture, family, nationality, race, age, gender, disability, sexuality etc.",
                        "Become aware of your own response and reactions to the differences within the group.",
                        "Investigate and analyse the implications of being perceived as ‘different’."
                    ],
                    "claims": []
                },
                {
                    "id": 3.2,
                    "title": "Identify and reflect on a range of diversity issues in the wider social context",
                    "guidance": [
                        "Discover the range of ways in which people experience discrimination.",
                        "Familiarise yourself with the legal aspects of anti-discrimination.",
                        "Explore own experience(s) of discrimination and discriminating.",
                        "Use the learning gained from understanding of diversity issues to inform your counselling practice sessions.",
                        "Take account of diversity issues when developing a counselling relationship.",
                        "Consider the needs of a client who has experienced discriminatory responses in society.",
                        "Show skills in observed counselling practice sessions."
                    ],
                    "claims": []
                },
                {
                    "id": 3.3,
                    "title": "Apply awareness of diversity issues to enhance empathic understanding",
                    "guidance": [
                        "Develop a more intimate sense of what another’s experience of difference has been by listening to the feelings and personal cost related to perceived or real difference.",
                        "Be prepared for – and aware of – your responses to the experience of difference.",
                        "Identify and understand personal blocks to empathy and identify issues you feel unable to empathise with.",
                        "Show skills in observed counselling practice sessions."
                    ],
                    "claims": []
                }
            ]
        },
        {
            "id": 4,
            "learningOutcome": "Work within a user-centred approach to counselling",
            "criteria": [
                {
                    "id": 4.1,
                    "title": "Establish the client’s needs and expectations when agreeing to work together",
                    "guidance": [
                        "Involve the client in the process of offering and agreeing a working contract which takes account of the client’s expectations as well as agency policies.",
                        "Understand the importance of listening for the client’s agenda rather than responding from your own frame of reference.",
                        "Show skills in observed counselling practice sessions."
                    ],
                    "claims": []
                },
                {
                    "id": 4.2,
                    "title": "Maintain the focus on the client’s agenda and needs",
                    "guidance": [
                        "Show how you have used case discussion to review client work, including the contract.",
                        "Recognise the need to be clear and yet sensitive to changes in client needs and behaviour which affect the working contract.",
                        "Practise this criterion in case discussion sessions.",
                        "Show skills in observed counselling practice sessions."
                    ],
                    "claims": []
                }
            ]
        },
        {
            "id": 5,
            "learningOutcome": "Use counselling theory to develop self-awareness in counselling practice",
            "criteria": [
                {
                    "id": 5.1,
                    "title": "Use counselling theory to understand own personality",
                    "guidance": [
                        "Reflect on ways in which theories introduced on the course have extended your understanding of yourself.",
                        "Reflect on one or more theories/ideas which help you to understand your personality more fully."
                    ],
                    "claims": []
                },
                {
                    "id": 5.2,
                    "title": "Use counselling theory to understand own personal history",
                    "guidance": [
                        "Reflect on theoretical ideas and concepts which help you to understand your life events and your responses to those events.",
                        "Apply theory to challenging issues in your formative years and gain awareness of how the past might impact on the present."
                    ],
                    "claims": []
                },
                {
                    "id": 5.3,
                    "title": "Use counselling theory to understand own relationships",
                    "guidance": [
                        "Reflect on theories which help you to understand your relationships, both past and present, and the way in which you form, develop, maintain and end those relationships."
                    ],
                    "claims": []
                },
                {
                    "id": 5.4,
                    "title": "Evidence how self-awareness contributes to the ability to empathise with others",
                    "guidance": [
                        "Reflect on own difficult personal issues in order to raise your awareness of the importance of being understood empathically.",
                        "Apply empathic understanding gained from exploring yourself (own internal conflicts and/or difficult life events and/or relationships with others).",
                        "Show understanding of the relationship between ‘exploring your own difficult issues’ and increasing your ‘ability to empathise with others’."
                    ],
                    "claims": []
                }
            ]
        },
        {
            "id": 6,
            "learningOutcome": "Understand theories of counselling and mental health",
            "criteria": [
                {
                    "id": 6.1,
                    "title": "Explain why theory is important in counselling work",
                    "guidance": [
                        "Reflect what is meant by theory.",
                        "Reflect on the role of theory in counselling work.",
                        "Explain why counsellors need to take into account theory in counselling work."
                    ],
                    "claims": []
                },
                {
                    "id": 6.2,
                    "title": "Describe the main theoretical approaches to counselling",
                    "guidance": [
                        "Develop understanding of the fundamental ideas behind the major theoretical approaches – e.g. psychodynamic, humanistic, cognitive, transpersonal etc.",
                        "Develop your understanding in relation to one or more counselling theories."
                    ],
                    "claims": []
                },
                {
                    "id": 6.3,
                    "title": "Use counselling theory to understand the client",
                    "guidance": [
                        "Show how different theories offer a different language and different way of understanding the client’s a) personality/self; b) personal history; c) patterns of relating (see the CPCAB model).",
                        "Apply knowledge of theory to a range of presenting problems and client issues."
                    ],
                    "claims": []
                },
                {
                    "id": 6.4,
                    "title": "Explain the nature of common mental health problems",
                    "guidance": [
                        "Identify and describe problems which are categorised as Common Mental Health Problems (CMHPs).",
                        "Offer explanations for the incidence of these problems in society."
                    ],
                    "claims": []
                },
                {
                    "id": 6.5,
                    "title": "Describe how counselling can promote positive mental health",
                    "guidance": [
                        "Explore the features of positive mental health.",
                        "Suggest ways in which counselling might have a positive impact on mental health."
                    ],
                    "claims": []
                },
                {
                    "id": 6.6,
                    "title": "Explain why research findings are important in counselling work",
                    "guidance": [
                        "Reflect on what is meant by research findings.",
                        "Explain why counsellors need to take account of research findings in counselling work."
                    ],
                    "claims": []
                }
            ]
        },
        {
            "id": 7,
            "learningOutcome": "Use feedback, reflection and supervision to support counselling studies",
            "criteria": [
                {
                    "id": 7.1,
                    "title": "Use feedback from others to develop understanding of counselling",
                    "guidance": [
                        "Identify constructive guidance provided by peers and tutors which has informed your learning.",
                        "Write about personal and course goals and your thoughts about achieving those goals.",
                        "Show your ability to plan and reflect."
                    ],
                    "claims": []
                },
                {
                    "id": 7.2,
                    "title": "Give constructive feedback to other counselling trainees",
                    "guidance": [
                        "Show your ability to critically evaluate counselling practice sessions.",
                        "Use feedback sheets to show your ability to give constructive feedback.",
                        "Show your ability to give verbal feedback to peers at the end of counselling practice sessions."
                    ],
                    "claims": []
                },
                {
                    "id": 7.3,
                    "title": "Describe the nature and use of clinical supervision",
                    "guidance": [
                        "Reflect on the insights and understanding gained from case discussion.",
                        "Identify situations in which your limited knowledge and skills were helped and supported by close discussion with your tutor and/or a more experienced counsellor.",
                        "Show your understanding of the role and importance of supervision."
                    ],
                    "claims": []
                },
                {
                    "id": 7.4,
                    "title": "Use supervisee skills to contribute to, and learn from, case discussion",
                    "guidance": [
                        "Record your input into case discussions.",
                        "Identify questions which help to provide support for a peer during case discussion.",
                        "Clarify the needs of the client by linking case information to counselling theory.",
                        "Record your use of insights gained from case discussion."
                    ],
                    "claims": []
                }
            ]
        }
    ]
}