{
  "courseTitle": "An example criteria set to show you how it works",
  "courseCode": "ABCDE 1234",
  "courseYear": "2024-2025",
  "sections": [
    {
      "id": 1,
      "learningOutcome": "Understand how to use the Criteria Tracker application",
      "criteria": [
        {
          "id": 1.1,
          "title": "Navigate the Criteria Tracker interface",
          "guidance": [
            "Familiarize yourself with the main sections of the application, including the dashboard, criteria sets, and progress tracking.",
            "Learn how to access a specific criteria set by selecting it from the list of available sets.",
            "Understand the layout of a criteria set, including sections, criteria, and guidance."
          ],
          "claims": [
            {
              "id": "3007ba54-5fea-4885-9591-ecbc0923a00b",
              "evidence": "Example evidence",
              "claimDate": "2024/10/24",
              "confirmed": true,
              "source": "Written"
            }
          ]
        },
        {
          "id": 1.2,
          "title": "Track progress on a specific criterion",
          "guidance": [
            "Select a criterion to view its details, including the title, guidance, and any associated claims.",
            "Mark a criterion as 'in progress' or 'completed' to reflect your current status.",
            "Add personal notes or reflections to a criterion to document your learning process."
          ],
          "claims": []
        },
        {
          "id": 1.3,
          "title": "Add claims to demonstrate evidence of learning",
          "guidance": [
            "Understand what constitutes a claim and how it supports your progress.",
            "Use the 'Add Claim' feature to upload evidence, such as documents, images, or text descriptions.",
            "Review and edit claims to ensure they align with the criterion's requirements."
          ],
          "claims": []
        },
        {
          "id": 1.4,
          "title": "Generate a progress report",
          "guidance": [
            "Learn how to generate a report summarizing your progress across all criteria.",
            "Customize the report to include specific sections, criteria, or claims.",
            "Export the report as a PDF or share it directly with your instructor or mentor."
          ],
          "claims": []
        }
      ]
    }
  ]
}
